print("Ласкаво просимо до обміну валют")

uah_account = float(input("Введіть суму гривень: "))

eur_currency = 43.65
usd_currency = 40.00

choosed_currency = ""

while choosed_currency not in ["1", "2"]:
    choosed_currency = input("""Оберіть одну із наступних валют, увівши відповідний номер:
1 - Євро
2 - Долар США
Обрана валюта: """)

    if choosed_currency not in ["1", "2"]:
        print("Невірний вибір валюти. Будь ласка, спробуйте ще раз.")


def exchange():
    if choosed_currency == "1":
        total = uah_account / eur_currency
        print(f"""Курс на поточний стан
-----------------------------------
{eur_currency} ГРИВЕНЬ за одне ЄВРО
-----------------------------------
""")
        print(f"""
////////////////////////////////////////
        У вас {"%.2f" % total} євро
////////////////////////////////////////""")
    elif choosed_currency == "2":
        total = uah_account / usd_currency
        print(f"""Курс на поточний стан

--------------------------------------------
{usd_currency} ГРИВЕНЬ за один ДОЛЛАР США
---------------------------------------------
        """)
        print(f"""
////////////////////////////////////
У вас {"%.2f" % total} долларів
/////////////////////////////////////
""")


exchange()